# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, FasterNet, []]  # 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 5 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 6
  - [-1, 1, Conv, [256, 1, 1]]  # 7, Y5, lateral_convs.0

  - [-1, 1,  Dy_Sample, []] # 8
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.1
  - [[-2, -1], 1, Bi_FPN, [ ]] # 10
  - [-1, 3, RepC3, [256, 0.5]]  # 11, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]   # 12, Y4, lateral_convs.1

  - [-1, 1,  Dy_Sample, []] # 8
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 14 input_proj.0
  - [[-2, -1], 1,Bi_FPN, [ ]]  # 15 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]    # X3 (16), fpn_blocks.1
  - [-1, 1, CA, []] #17

  - [-1, 1, ADown, [256]]   # 18, downsample_convs.0
  - [[-1, 12], 1, Bi_FPN, [ ]]  # 19 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]    # F4 (20), pan_blocks.0
  - [-1, 1, CBAM, []] #21

  - [-1, 1, ADown, [256]]   # 22, downsample_convs.1
  - [[-1, 7], 1,Bi_FPN, [ ]]  # 23 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]    # F5 (24), pan_blocks.1
  - [-1, 1, TripletAttention, []] #25

  - [[17, 21, 25], 1, RTDETRDecoder, [nc]]  # Detect(P3, P4, P5)